app/controllers/event_controller.rb

    def show
        if valid_page?
            @event = Event.where(:event_type => params[:event].downcase)
                         .where(:language => params[:lang].downcase)[0]
---
SELECT "events".* FROM "events" WHERE "events"."event_type" = ? AND "events"."language" = ?  [["event_type", "tamale-fest"], ["language", "en"]]