app/views/layouts/navbar.html.erb

SELECT "events".* FROM "events" WHERE "events"."language" = ?  [["language", "en"]]
---
    <div class="navbar-header">
      <% events = Event.where(:language => params[:lang])%>